#### Terraform Initialization ⚙️
#### Terraform Plan 📖 `success`

```
module.new-vpc.aws_vpc.new-vpc: Refreshing state... [id=vpc-095ca8d87905bbbe8]
module.eks.aws_iam_role.cluster: Refreshing state... [id=platformoon-kafkamoon-role]
module.eks.aws_cloudwatch_log_group.log: Refreshing state... [id=/aws/eks-kafkaoon/platformoon-kafkamoon/cluster]
module.eks.aws_iam_role.node: Refreshing state... [id=platformoon-kafkamoon-role-node]
module.eks.aws_iam_role_policy_attachment.cluster-AmazonEKSVPCResourceController: Refreshing state... [id=platformoon-kafkamoon-role-20240426004723721900000001]
module.eks.aws_iam_role_policy_attachment.cluster-AmazonEKSClusterPolicy: Refreshing state... [id=platformoon-kafkamoon-role-20240426004723736700000002]
module.eks.aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=platformoon-kafkamoon-role-node-20240426004723793400000003]
module.eks.aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy: Refreshing state... [id=platformoon-kafkamoon-role-node-20240426004723822300000004]
module.eks.aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=platformoon-kafkamoon-role-node-20240426004723837200000005]
module.new-vpc.aws_internet_gateway.new-igw: Refreshing state... [id=igw-0da50f6961ab48cd5]
module.new-vpc.aws_subnet.subnets[0]: Refreshing state... [id=subnet-02c3745a07fd44b7f]
module.eks.aws_security_group.sg: Refreshing state... [id=sg-0cb56d657f1ecaf61]
module.new-vpc.aws_subnet.subnets[1]: Refreshing state... [id=subnet-012ad2fb4bd63fbe2]
module.new-vpc.aws_route_table.new-rtb: Refreshing state... [id=rtb-09922bd517832e7e8]
module.new-vpc.aws_route_table_association.new-rtb-association[0]: Refreshing state... [id=rtbassoc-0fb7a027c4d994900]
module.new-vpc.aws_route_table_association.new-rtb-association[1]: Refreshing state... [id=rtbassoc-07eb4eeed758d8d18]
module.eks.aws_eks_cluster.cluster: Refreshing state... [id=platformoon-kafkamoon]
module.eks.aws_eks_node_group.node-1: Refreshing state... [id=platformoon-kafkamoon:node-1]
module.eks.local_file.kubeconfig: Refreshing state... [id=8f70fc80ac3a23749960328f044c001943a67042]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.aws_cloudwatch_log_group.log has changed
  ~ resource "aws_cloudwatch_log_group" "log" {
        id                = "/aws/eks-kafkaoon/platformoon-kafkamoon/cluster"
        name              = "/aws/eks-kafkaoon/platformoon-kafkamoon/cluster"
      + tags              = {}
        # (5 unchanged attributes hidden)
    }

  # module.eks.aws_eks_cluster.cluster has changed
  ~ resource "aws_eks_cluster" "cluster" {
        id                        = "platformoon-kafkamoon"
        name                      = "platformoon-kafkamoon"
      + tags                      = {}
        # (11 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_eks_node_group.node-1 has changed
  ~ resource "aws_eks_node_group" "node-1" {
        id              = "platformoon-kafkamoon:node-1"
      + labels          = {}
      + tags            = {}
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_iam_role.cluster has changed
  ~ resource "aws_iam_role" "cluster" {
        id                    = "platformoon-kafkamoon-role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          + "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ]
        name                  = "platformoon-kafkamoon-role"
      + tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.node has changed
  ~ resource "aws_iam_role" "node" {
        id                    = "platformoon-kafkamoon-role-node"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          + "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ]
        name                  = "platformoon-kafkamoon-role-node"
      + tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.eks.local_file.kubeconfig has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            clusters:
            - cluster:
                server: https://3C54FB63D93B561B4142E5F89FC4F1A6.gr7.us-east-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJYU5ZN2NsY1FFNjh3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBME1qWXdNRFEzTURKYUZ3MHpOREEwTWpRd01EVXlNREphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUNZckZadldhc3dNZzRFQURKc1laN0N1cGpFUUJzUUlKbHE3WDNCSFh2OW12YkJLWlJjMU92eW1RNXEKc1V1ZFNQUkZvVXZXL3B1TC9QcGpSdi93V25jSnd3amhrMTBjZkttV1pxdjNMdlN5ZU5iQzlLcytYdCtLdVZGTAp5TkVJWVpsdnRZbm5aUU1nQnhTaHVuOTRwa1RzN1RQOVo0NDlNbE5ld1ZHQ0ptWFVvZDRFUFI4V2QrbGJ4VGJNCjFCTGpHU1dmc0pVRkRXUVRTMUhPQjBpY3NnVWg0dzJJYSsvOUtGcGRyRW9RazRXYThwWStzQkNERXhzdThkL2gKRHRiVHZEampSMkNhRmNyOGJadmlIczREeVlLMkkxRThXWU12aVh6emFMR2s1YnEySmVidTJ2NWFDWVhNZlllMAozSnBJUHpUTlBUaVpocTlUNHdGTk10VDhvYnF6QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRbVhIdm1vZmVNdGY2RStSVWhPUC9yeXJyWWV6QVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQmNBdE9saHpvUgprcmhPVS9mcnQ0dlJ2R0ZLL0Q4TGYxR29JZUNoU1BWK21iRG1GTDFXS1Rod09ZNXo4VjEybVFVZjFMakRrNGNzCk9CdVd5QXM0VnNMbnpOeEw4dk85WHRYVW5qUjZMZ3JsUjE4c3BJSHlOWDJCV3lOZ0xWOFVrK0RvL2RFd0ZUUmcKV2M4RFVoZ1dKcnNsR2RRamZyTWllN2JRRzhKSDRYM3Rsa2t0aHUxenhpRkdTK0ZtTkxCbk92RXpTOVE4V2l3agpsQlVjQXlmME80cUxGTXhPQ3BqT0Z3RGozTWhEcFFOU0JkY0xVd0k4bTBUSXpJK1AwVmJWeGZtOFNwd2M0ZXIrCk53dmlwNS9QMlg4eUV6ekZHUlRVMVNnL0FqYm1Pa2RHWW00eUVMdjRSM0g1TlcwVEdKSnR4ak5nYkU1RGVRQ2IKUW9zVW1MKzNnZG9PCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
              name: kubernetes
            contexts:
            - context:
                cluster: kubernetes
                user: "platformoon-kafkamoon"
              name: "platformoon-kafkamoon"
            current-context: "platformoon-kafkamoon"
            kind: Config
            preferences: {}
            users:
            - name: "platformoon-kafkamoon"
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "platformoon-kafkamoon"
        EOT -> null
      - content_base64sha256 = "m0rOStBUTR6vQRBu5DZE75qBUW7x7KGAuNCOOT0W7ek=" -> null
      - content_base64sha512 = "eFRhsYA+z3JkNFfMtVBxk5YS32vCuE9REavWnJAIy4np53nL14Gn6kHsCQRs40K4oX/bGEMcfeT0+5RGoGBMFA==" -> null
      - content_md5          = "f93900bfe09876aed40b2996b5bcce9d" -> null
      - content_sha1         = "8f70fc80ac3a23749960328f044c001943a67042" -> null
      - content_sha256       = "9b4ace4ad0544d1eaf41106ee43644ef9a81516ef1eca180b8d08e393d16ede9" -> null
      - content_sha512       = "785461b1803ecf72643457ccb55071939612df6bc2b84f5111abd69c9008cb89e9e779cbd781a7ea41ec09046ce342b8a17fdb18431c7de4f4fb9446a0604c14" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "kubeconfig" -> null
      - id                   = "8f70fc80ac3a23749960328f044c001943a67042" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.kakfamoon_api will be created
  + resource "aws_ecr_repository" "kakfamoon_api" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "kakfamoon-api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "application" = "kakfamoon-api"
        }
      + tags_all             = {
          + "application" = "kakfamoon-api"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.eks.local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            clusters:
            - cluster:
                server: https://3C54FB63D93B561B4142E5F89FC4F1A6.gr7.us-east-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJYU5ZN2NsY1FFNjh3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBME1qWXdNRFEzTURKYUZ3MHpOREEwTWpRd01EVXlNREphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUNZckZadldhc3dNZzRFQURKc1laN0N1cGpFUUJzUUlKbHE3WDNCSFh2OW12YkJLWlJjMU92eW1RNXEKc1V1ZFNQUkZvVXZXL3B1TC9QcGpSdi93V25jSnd3amhrMTBjZkttV1pxdjNMdlN5ZU5iQzlLcytYdCtLdVZGTAp5TkVJWVpsdnRZbm5aUU1nQnhTaHVuOTRwa1RzN1RQOVo0NDlNbE5ld1ZHQ0ptWFVvZDRFUFI4V2QrbGJ4VGJNCjFCTGpHU1dmc0pVRkRXUVRTMUhPQjBpY3NnVWg0dzJJYSsvOUtGcGRyRW9RazRXYThwWStzQkNERXhzdThkL2gKRHRiVHZEampSMkNhRmNyOGJadmlIczREeVlLMkkxRThXWU12aVh6emFMR2s1YnEySmVidTJ2NWFDWVhNZlllMAozSnBJUHpUTlBUaVpocTlUNHdGTk10VDhvYnF6QWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRbVhIdm1vZmVNdGY2RStSVWhPUC9yeXJyWWV6QVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQmNBdE9saHpvUgprcmhPVS9mcnQ0dlJ2R0ZLL0Q4TGYxR29JZUNoU1BWK21iRG1GTDFXS1Rod09ZNXo4VjEybVFVZjFMakRrNGNzCk9CdVd5QXM0VnNMbnpOeEw4dk85WHRYVW5qUjZMZ3JsUjE4c3BJSHlOWDJCV3lOZ0xWOFVrK0RvL2RFd0ZUUmcKV2M4RFVoZ1dKcnNsR2RRamZyTWllN2JRRzhKSDRYM3Rsa2t0aHUxenhpRkdTK0ZtTkxCbk92RXpTOVE4V2l3agpsQlVjQXlmME80cUxGTXhPQ3BqT0Z3RGozTWhEcFFOU0JkY0xVd0k4bTBUSXpJK1AwVmJWeGZtOFNwd2M0ZXIrCk53dmlwNS9QMlg4eUV6ekZHUlRVMVNnL0FqYm1Pa2RHWW00eUVMdjRSM0g1TlcwVEdKSnR4ak5nYkU1RGVRQ2IKUW9zVW1MKzNnZG9PCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
              name: kubernetes
            contexts:
            - context:
                cluster: kubernetes
                user: "platformoon-kafkamoon"
              name: "platformoon-kafkamoon"
            current-context: "platformoon-kafkamoon"
            kind: Config
            preferences: {}
            users:
            - name: "platformoon-kafkamoon"
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "platformoon-kafkamoon"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "kubeconfig"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

*Pusher: @mcruzdev, Action: `pull_request`, Workflow: `Terraform GitOps Plan`*